class Lexicon:
    ASK_LOCATION = {
        "en": {
            "ask_loc": "Where should we look for places?",
            "loc": "Enter a city to search:"},
        "ru": {
            "ask_loc": "Где будем искать места?",
            "loc": "Введите город для поиска:"},
        "ua": {
            "ask_loc": "Де будемо шукати місця?",
            "loc": "Введіть місто для пошуку:"}
    }

    AUTO_LOCATION = {
        "en": "Press to send your geolocation",
        "ru": "Нажми для отправки твоей геопозиции",
        "ua": "Натисни для відправки твої геолокації",
    }

    MANUAL_LOCATION = {
        "en": "Your city",
        "ru": "Ваш город",
        "ua": "Ваше місто",
    }

    GEOPY_FAILED = {
        "en": {
            "auto": "There is a problem with autodetection of your location. Please try again later or enter your city manually.",
            "manual": "The city may have been entered incorrectly, please try again"},
        "ru": {
            "auto": "Возникла проблема при автоматическом определении вашей геолокации. Пожалуйста, попробуйте еще раз позже или введите ваш город вручную",
            "manual": "Возможно город введён некорректно, попробуйте ещё раз"},
        "ua": {
            "auto": "Виникла помилка при автоматичному визначенні вашої геолокації. Будь ласка, спробуйте ще раз пізніше або введіть ваше місто вручну",
            "manual": "Можливо місто введене некоректно, спробуйте ще раз"}
    }

    GET_CRITERIA = {
        "en": "What are we looking for today?",
        "ru": "Что будем искать сегодня?",
        "ua": "о будемо шукати сьогодні?",
    }

    CRITERIA_FAILED = {
        "en": "Unfortunately, nothing was found 😔 Try changing your criteria.",
        "ru": "К сожалению, ничего не нашлось 😔 Попробуйте изменить критерии.",
        "ua": "На жаль, нічого не знайдено 😔 Спробуйте змінити критерії.",
    }

    AI_PENDING = {
        "en": f"🔍 Searching the best places in your city...",
        "ru": f"🔍 Ищу лучшие места в вашем городе...",
        "ua": f"🔍 Шукаю найкращі місця в твоєму місті...",
    }

    VENUE_ANALIZING = {
        "en": "⏳ <b>Analyzing the city's restaurant map...</b> This may take a few seconds.",
        "ru": "⏳ <b>Анализирую гастро-карту города...</b>\nЭто может занять пару секунд.",
        "ua": "⏳ <b>Аналізую гастро-карту міста...</b>\nЦе може зайняти кілька секунд."
    }

    VENUE_ERROR = {
        "en": {
            "empty_list": "The list of recommendations is empty or an error occurred.",
            "data_display_error": "Data display error"},
        "ru": {
            "empty_list": "Список рекомендаций пуст или произошла ошибка.",
            "data_display_error": "Ошибка отображения данных"},
        "ua": {
            "empty_list": "Список рекомендацій порожній або помилка.",
            "data_display_error": "Помилка відображення даних"}
    }

    @classmethod
    def get(cls, key: dict, lang: str) -> str:
        return key.get(lang, key["en"])